In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {'one':[10, np.nan, 30], 'two':[np.nan,np.nan,30], 'three':[10,10,30]}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [5]:
df_2 = df.copy()

In [6]:
df_2

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [7]:
df.dropna()

    one   two  three
2  30.0  30.0     30

In [8]:
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [9]:
df_2.dropna(inplace=True)

In [10]:
df_2

    one   two  three
2  30.0  30.0     30

In [11]:
df_3 = df.copy()

In [12]:
df_3

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [13]:
df_3.dropna(axis=1, inplace=True)

In [14]:
df_3

   three
0     10
1     10
2     30

In [15]:
df_4 = df.copy()

In [16]:
df_4

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [20]:
df_4.dropna(thresh=2, inplace=True)

In [21]:
df_4

    one   two  three
0  10.0   NaN     10
2  30.0  30.0     30

In [22]:
df_5 = df.copy()

In [23]:
df_5

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [27]:
df_5.fillna(value = np.random.randint(10,40),inplace =True)

In [28]:
df_5

    one   two  three
0  10.0  31.0     10
1  31.0  31.0     10
2  30.0  30.0     30

    one   two  three
0  10.0  31.0     10
1  31.0  31.0     10
2  30.0  30.0     30

In [30]:
df_6 = df.copy()

In [31]:
df_6

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  30.0     30

In [33]:
df_6['one'].fillna(value = df_6['one'].mean(), inplace=True)

In [34]:
df_6

    one   two  three
0  10.0   NaN     10
1  20.0   NaN     10
2  30.0  30.0     30

/home/artiom/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [43]:
df_6

    one   two  three
0  10.0   NaN     10
1  20.0   NaN     10
2  30.0  30.0     30